# <p style="color:black"> EDA OF MOVIE RAW DATA

<figure>
    <img src="movie header.jpg"
         alt="Movie Studio"
         width="400"
         height="200">
    <figcaption><center><bold>Microsoft's new movie studio!</figcaption>
</figure>

The purpose of this notebook is to perform exploratory data anlysis of the movie studio information that was provided to our group for the Phase 1 Project. When looking at the data, it can be broken up into two types:

1. An extract from IMDB, which is presented in a .db database file, and
2. Various CSV style files from different movie analysis websites.

This notebook's analysis will be structured as such:

- Analysis of the database file
- Analysis of the high priority CSV files (mainly, `bom.movie_gross.csv.gz`)
- Analysis of the remaining CSV files
- Preliminary thoughts on combination of files, and
- Preliminary thoughts on the group project story

# <p style="color:black"> DATABASE SECTION

## <p style="color:black"> Database - Short summary of findings

In short, the database information gives a lot of color and background to each of the movie_id's. From the movie_id, we can determine genre, geography, language, and the people who are involved in the film through use of SQL combination scripts.

This database will likely become relevant once we are able to put more numbers and analysis to the performance of the movies, which will likely come from the csv files.

See the section on the CSV files for more analysis

## <p style="color:black"> Analysis of the database file

To begin, we will import the SQL lite database package and import the database

In [1]:
import sqlite3
import pandas as pd
import numpy as np
conn = sqlite3.connect("Raw Data/im.db")
cur = conn.cursor()

Let's take a look at the names of all the tables, and compare it to the schema that was presented in the intro materials:

In [2]:
df = pd.read_sql("""
SELECT name as table_name
FROM sqlite_master
WHERE type = 'table';
""", conn)
df

      table_name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [3]:
df.head()

      table_name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings

<figure>
    <img src="movie_data_erd.jpeg"
         alt="Database Schema"
         width="600"
         height="300">
    <figcaption><center><bold>It is clear from analyzing the tables that the schema jpg is accurate and the database is loaded</figcaption>
</figure>

### <p style="color:black"> Table: Persons

In [4]:
df_persons = pd.read_sql("""
SELECT *
FROM persons
""", conn)
df_persons.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 5 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   person_id           606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
dtypes: float64(2), object(3)
memory usage: 23.1+ MB

In [5]:
df_persons.head(5)

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"

In [6]:
df_persons_IDname = df_persons.filter(['person_id', 'primary_name'], axis=1)
df_persons_IDname.head(10)

   person_id       primary_name
0  nm0061671  Mary Ellen Bauder
1  nm0061865       Joseph Bauer
2  nm0062070         Bruce Baum
3  nm0062195       Axel Baumann
4  nm0062798        Pete Baxter
5  nm0062879     Ruel S. Bayani
6  nm0063198              Bayou
7  nm0063432      Stevie Be-Zet
8  nm0063618          Jeff Beal
9  nm0063750    Lindsay Beamish

Conclusion:
- The primary key of this data is likely person_id
- This table looks like a mostly complete list of persons, names, and their professions
- Primary professions has an embedded list of data inside of it
- The most useful columns for this are likely person_id and primary_profession, as they will link certain tables together

### <p style="color:black"> Table: Principals

In [7]:
df_principals = pd.read_sql("""
SELECT *
FROM principals
""", conn)
df_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [8]:
df_principals.tail(5)

,movie_id,ordering,person_id,category,job,characters
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

In [9]:
df_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [10]:
df_principals['category'].value_counts()

actor                  256718
director               146393
actress                146208
producer               113724
cinematographer         80091
composer                77063
writer                  74357
self                    65424
editor                  55512
production_designer      9373
archive_footage          3307
archive_sound              16
Name: category, dtype: int64

In [11]:
df_p_dirmovieID = df_principals.filter(['person_id', 'movie_id', 'category'], axis=1)

In [12]:
df_p_dirmovieID.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 3 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1028186 non-null  object
 1   movie_id   1028186 non-null  object
 2   category   1028186 non-null  object
dtypes: object(3)
memory usage: 23.5+ MB

In [13]:
df_directors_IDs = df_p_dirmovieID.loc[df_p_dirmovieID['category'].isin(['director'])]

In [14]:
df_directors_IDs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146393 entries, 1 to 1028183
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   person_id  146393 non-null  object
 1   movie_id   146393 non-null  object
 2   category   146393 non-null  object
dtypes: object(3)
memory usage: 4.5+ MB

In [15]:
df_directors_IDs.head(12)

    person_id   movie_id  category
1   nm0398271  tt0111414  director
8   nm0362736  tt0323808  director
18  nm1145057  tt0417610  director
28  nm0707738  tt0469152  director
35  nm0776090  tt0473032  director
41  nm0001053  tt0475290  director
42  nm0001054  tt0475290  director
51  nm0197636  tt0477302  director
61  nm0007082  tt0780548  director
71  nm1275939  tt0879405  director
81  nm0278181  tt0884726  director
82  nm0820800  tt0884726  director

In [16]:
df_directors_id = df_directors_IDs.merge(df_persons_IDname, on='person_id', how='inner')
df_directors_id.head(7)

   person_id   movie_id  category       primary_name
0  nm0398271  tt0111414  director       Frank Howson
1  nm0398271  tt5573596  director       Frank Howson
2  nm0362736  tt0323808  director        Robin Hardy
3  nm1145057  tt0417610  director  Alejandro Chomski
4  nm1145057  tt5291716  director  Alejandro Chomski
5  nm1145057  tt4551544  director  Alejandro Chomski
6  nm0707738  tt0469152  director  Alyssa R. Bennett

Conclusion:
- The primary key of this table appears to be person_id
- This table goes into detail on which person is related to which movie
- Characters is a list of all relevant characters for an actor
- The most useful columns for this are likely person_id, category, and movie_id, as they could provide links for data attributes

### <p style="color:black"> Table: Known For, Directors, and Writers

Note: These tables appear similar in nature in that they are connector tables or subsets of the Principals table. This section will explore how/if these tables can be combined

In [17]:
df_principals = pd.read_sql("""
SELECT *
FROM known_for
""", conn)
df_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1638260 entries, 0 to 1638259
Data columns (total 2 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1638260 non-null  object
 1   movie_id   1638260 non-null  object
dtypes: object(2)
memory usage: 25.0+ MB

In [18]:
df_principals.head(2)

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241

In [19]:
df_directors = pd.read_sql("""
SELECT *
FROM directors
""", conn)
df_principals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1638260 entries, 0 to 1638259
Data columns (total 2 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1638260 non-null  object
 1   movie_id   1638260 non-null  object
dtypes: object(2)
memory usage: 25.0+ MB

In [20]:
df_directors.head(2)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585

In [21]:
df_writers = pd.read_sql("""
SELECT *
FROM writers
""", conn)
df_writers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 255873 entries, 0 to 255872
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   movie_id   255873 non-null  object
 1   person_id  255873 non-null  object
dtypes: object(2)
memory usage: 3.9+ MB

In [22]:
df_writers.head(2)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726

Conclusion:
- All tables contain movie_id and person_id fields and are complete
- Principals and directors tables have the same numer of records (1.6m), Writers has about a fourth of that
- It is not immediately clear the benefit of combining these together, however when we formulate our hypothesis, perhaps it will become more evident of the value of linking movies and their associated people (writers, directors, etc)

### <p style="color:black"> Table: Movie Basics

In [23]:
df_movie_basics = pd.read_sql("""
SELECT *
FROM movie_basics
""", conn)
df_movie_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [24]:
df_movie_basics.head(4)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"

In [25]:
df_mbasics = df_movie_basics.filter(['movie_id', 'primary_title', 'genres'], axis=1)
df_mbasics.head()

    movie_id                    primary_title                genres
0  tt0063540                        Sunghursh    Action,Crime,Drama
1  tt0066787  One Day Before the Rainy Season       Biography,Drama
2  tt0069049       The Other Side of the Wind                 Drama
3  tt0069204                  Sabse Bada Sukh          Comedy,Drama
4  tt0100275         The Wandering Soap Opera  Comedy,Drama,Fantasy

Conclusion:
- Seems like a solid index for basic movie information
- Primary key is likely 'movie_id'
- Genres contains a list of genres
- Mostly complete except for runtime and genres, which look about 90% complete

### <p style="color:black"> Table: Movie Ratings

In [26]:
df_movie_ratings = pd.read_sql("""
SELECT *
FROM movie_ratings
""", conn)
df_movie_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [27]:
df_movie_ratings.head(10)

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
5   tt1069246            6.2       326
6   tt1094666            7.0      1613
7   tt1130982            6.4       571
8   tt1156528            7.2       265
9   tt1161457            4.2       148

In [28]:
df_movie_ratings['averagerating'] = df_movie_ratings['averagerating']
df_high_rtg = df_movie_ratings[df_movie_ratings['averagerating'] >= 7.0]
df_high_rtgs = df_high_rtg[df_high_rtg['numvotes'] >= 5000]
df_high_rtgs.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1322 entries, 12 to 73727
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       1322 non-null   object
 1   averagerating  1322 non-null   float64
 2   numvotes       1322 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 41.3+ KB

In [29]:
df_high_rtgs.head()

     movie_id  averagerating  numvotes
12  tt1181840            7.0      5494
16  tt1210166            7.6    326657
19  tt1229238            7.4    428142
20  tt1232829            7.2    477771
59  tt1403981            7.1    129443

In [30]:
df_title_rtg = df_mbasics.merge(df_high_rtgs, on='movie_id', how='inner')
df_title_rtg.head(2)

,movie_id,primary_title,genres,averagerating,numvotes
0,tt0315642,Wazir,"Action,Crime,Drama",7.1,15378
1,tt0359950,The Secret Life of Walter Mitty,"Adventure,Comedy,Drama",7.3,275300

In [31]:
df_title_rtg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1322 entries, 0 to 1321
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       1322 non-null   object
 1   primary_title  1322 non-null   object
 2   genres         1322 non-null   object
 3   averagerating  1322 non-null   float64
 4   numvotes       1322 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 62.0+ KB

In [32]:
df_movies_info = df_title_rtg.merge(df_directors_id, on='movie_id', how='inner')
df_movies_info.head()

,movie_id,primary_title,genres,averagerating,numvotes,person_id,category,primary_name
0,tt0315642,Wazir,"Action,Crime,Drama",7.1,15378,nm2349060,director,Bejoy Nambiar
1,tt0369610,Jurassic World,"Action,Adventure,Sci-Fi",7.0,539338,nm1119880,director,Colin Trevorrow
2,tt0398286,Tangled,"Adventure,Animation,Comedy",7.8,366366,nm1977355,director,Nathan Greno
3,tt0398286,Tangled,"Adventure,Animation,Comedy",7.8,366366,nm0397174,director,Byron Howard
4,tt0433035,Real Steel,"Action,Drama,Family",7.1,283534,nm0506613,director,Shawn Levy

In [33]:
df_movies_info.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1393 entries, 0 to 1392
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       1393 non-null   object
 1   primary_title  1393 non-null   object
 2   genres         1393 non-null   object
 3   averagerating  1393 non-null   float64
 4   numvotes       1393 non-null   int64
 5   person_id      1393 non-null   object
 6   category       1393 non-null   object
 7   primary_name   1393 non-null   object
dtypes: float64(1), int64(1), object(6)
memory usage: 97.9+ KB

In [34]:
df_movies_info.value_counts(['genres'])

genres
Drama                          114
Comedy,Drama                    80
Drama,Romance                   50
Adventure,Animation,Comedy      48
Comedy,Drama,Romance            47
                              ...
Documentary,Drama,News           1
Animation,Crime,Documentary      1
Documentary,Drama,History        1
Animation,Drama                  1
Romance,Sci-Fi,Thriller          1
Length: 221, dtype: int64

In [35]:
df_movies_info.value_counts(['averagerating'])

averagerating
7.2              174
7.1              167
7.0              140
7.4              130
7.3              128
7.5              108
7.6               97
7.7               88
7.8               85
8.1               52
8.0               51
7.9               48
8.2               34
8.3               32
8.5               15
8.4               13
8.8                9
8.7                7
8.6                4
9.3                3
9.4                3
9.5                2
8.9                1
9.2                1
9.7                1
dtype: int64

Conclusion:
- Contains rating information by movie ID
- Data set appears complete
- Could be useful for understanding a movie's reception vs it's revenue

### <p style="color:black"> Table: Movie AKA's

In [36]:
df_movie_akas = pd.read_sql("""
SELECT *
FROM movie_akas
""", conn)
df_movie_akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   movie_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [37]:
df_movie_akas.tail(15)

,movie_id,ordering,title,region,language,types,attributes,is_original_title
331688,tt9705860,3,Dusan Vukotic hrvatski okarovac,HR,None,None,None,0.0
331689,tt9723084,1,Anderswo. Allein in Afrika,DE,None,imdbDisplay,None,0.0
331690,tt9723084,2,Anderswo. Allein in Afrika,None,None,original,None,1.0
331691,tt9726638,1,Qi Tian Da Sheng 2,CN,yue,imdbDisplay,None,0.0
331692,tt9726638,2,Monkey King: The Volcano,None,None,original,None,1.0
331693,tt9726638,3,Qi Tian Da Sheng Huo Yan Shan,CN,yue,imdbDisplay,None,0.0
331694,tt9755806,1,Big Shark,US,None,None,None,0.0
331695,tt9755806,2,Большая Акула,RU,None,None,None,0.0
331696,tt9755806,3,Big Shark,None,None,original,None,1.0
331697,tt9827784,1,Sayonara kuchibiru,JP,None,None,None,0.0
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

Conclusion:
- Could be useful for understanding the region and language a particular movie was distributed in
- Mostly complete, but contains a lot of missing values in the language, attributes, and types fields

# <p style="color:black"> CSV SECTION

## <p style="color:black"> Short Summary of CSV Files

The CSV files will take some work to combine, but at the end of the day, they will contain important pieces of information we can use for our story. In my mind, the following data points are important and we can get them from the following (files)

For each movie:
- The movie ID (tn.movie_budgets.csv.gz)
- The title (movie_budgets.csv.gz)
- The studio (bom.movie_gross.csv.gz)
- The domestic gross (bom.movie_gross.csv.gz -or- movie_budgets.csv.gz)
- The international gross (bom.movie_gross.csv.gz -or- movie_budgets.csv.gz)
- The year it came out (bom.movie_gross.csv.gz)
- The genre (movie_info.tsv.gz)
- The director (movie_info.tsv.gz)
- The writer (rt.movie_info.tsv.gz)

For each studio:
- Movies published by that studio (bom.movie_gross.csv.gz)
- Domestic and international gross of that studio over time (rt.movie_info.tsv.gz)
 - Maybe we can throw in what kind of genres each studio excel in

## <p style="color:black"> Analysis of CSV files

The CSV files are made up of the five files
- Bom.Movie_gross.csv.gz
- rt.movie_info_tsv.gz
- rt.reviews.tsv.gz
- tmdb.movies.csv.gz
- tn.movie_budgets.csv.gz

## <p style="color:black"> CSV File: bom.movie_gross.csv.gz

In [38]:
df_movie_gross = pd.read_csv("Raw Data/bom.movie_gross.csv.gz")
import seaborn as sns
import matplotlib.pyplot as plt

In [39]:
df_movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [40]:
df_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [41]:
df_movie_gross.pivot_table(index='studio', columns='year', values='domestic_gross', aggfunc='sum')

year,2010,2011,2012,2013,2014,2015,2016,2017,2018
studio,,,,,,,,,
3D,6100000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
A23,NaN,151000.0,NaN,13200.0,NaN,NaN,NaN,NaN,NaN
A24,NaN,NaN,NaN,27845400.0,18988300.0,59675100.0,76431700.0,95405700.0,45848000.0
ADC,NaN,NaN,NaN,NaN,NaN,228000.0,NaN,20200.0,NaN
AF,NaN,NaN,1155000.0,76900.0,558000.0,353000.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
XL,NaN,NaN,NaN,117000.0,341000.0,NaN,NaN,NaN,NaN
YFG,NaN,NaN,NaN,NaN,NaN,NaN,1100000.0,NaN,NaN
Yash,43800.0,496000.0,5352600.0,8000000.0,NaN,2379000.0,8500000.0,6530000.0,330000.0
Zee,NaN,NaN,NaN,NaN,NaN,NaN,1100000.0,NaN,NaN
Zeit.,1398000.0,1571200.0,550000.0,785000.0,504700.0,22900.0,11700.0,820000.0,NaN

Conclusion:
- This will be a very important data set, as it contains the domestic and foreign gross for each movie
- This data is not complete, and does not have a movie_id for movies which could link it back to the IMDB movie database
- Additionally, we do not know what currency the foreign currency is denominated in

## <p style="color:black"> CSV File: rt.movie_info.tsv.gz

In [42]:
df_movie_info = pd.read_csv("Raw Data/rt.movie_info.tsv.gz", sep='\t')

In [43]:
df_movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [44]:
df_movie_info.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

Conclusion:
- Man, this data sucks
- There is no movie title! More likely, we will need to pull together the director, year, and studio of each of these in order to link it to other data tables
- Unclear what kind of value add information this creates for our hypothesis

## <p style="color:black"> CSV File: rt.reviews.tsv.gz

In [45]:
df_movie_reviews = pd.read_csv("Raw Data/rt.reviews.tsv.gz", sep='\t', encoding='latin1')

In [46]:
df_movie_reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [47]:
df_movie_reviews.tail()

,id,review,rating,fresh,critic,top_critic,publisher,date
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

Conclusion:
- Again, this data is pretty rough. There isn't a good way to identify what the movie title is, nor what studio it is affiliated with.
- It does give a rating for each movie, but identifying what movie it related to will be tough

## <p style="color:black"> CSV File: tmdb.movies.csv.gz

In [48]:
df_movie_db2 = pd.read_csv("Raw Data/tmdb.movies.csv.gz")

In [49]:
df_movie_db2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [50]:
df_movie_db2.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

Conclusion:
- Complete list of data for movies. Has some type of ID, but unclear what kind of ID this is
- Contains popularity data, likely some kind of user generated reviews, possibily?

## <p style="color:black"> CSV File: tn.movie_budgets.csv.gz

In [51]:
df_budgets = pd.read_csv("Raw Data/tn.movie_budgets.csv.gz")

In [52]:
df_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [53]:
##
##Financial Data CSV

In [54]:
df_financial_data = pd.read_csv('financial_data.csv')

In [55]:
df_financial_data.head()

,Unnamed: 0,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,year_x,profit,profit_margin,...,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,year_y
0,0,7,2015-11-06,The Peanuts Movie,99000000.0,130178411.0,250091610.0,2015,151091610.0,60.414506,...,tt2452042,movie,The Peanuts Movie,The Peanuts Movie,0,2015-01-01 00:00:00,\N,88,"Adventure,Animation,Comedy",2015.0
1,2,9,2018-11-21,Robin Hood,99000000.0,30824628.0,84747441.0,2018,-14252559.0,-16.817687,...,tt4532826,movie,Robin Hood,Robin Hood,0,2018-01-01 00:00:00,\N,116,"Action,Adventure,Drama",2018.0
2,3,12,2017-05-19,Alien Covenant,97000000.0,74262031.0,238521247.0,2017,141521247.0,59.332763,...,tt2316204,movie,Alien Covenant,Alien: Covenant,0,2017-01-01 00:00:00,\N,122,"Horror,Sci-Fi,Thriller",2017.0
3,6,14,2012-07-13,Ice Age Continental Drift,95000000.0,161321843.0,879765137.0,2012,784765137.0,89.201663,...,tt1667889,movie,Ice Age Continental Drift,Ice Age: Continental Drift,0,2012-01-01 00:00:00,\N,88,"Adventure,Animation,Comedy",2012.0
4,7,16,2010-05-27,Sex and the City 2,95000000.0,95347692.0,294680778.0,2010,199680778.0,67.761725,...,tt1261945,movie,Sex and the City 2,Sex and the City 2,0,2010-01-01 00:00:00,\N,146,"Comedy,Drama,Romance",2010.0

In [56]:
df_financial_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1179 entries, 0 to 1178
Data columns (total 21 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         1179 non-null   int64
 1   id                 1179 non-null   int64
 2   release_date       1179 non-null   object
 3   movie              1179 non-null   object
 4   production_budget  1179 non-null   float64
 5   domestic_gross     1179 non-null   float64
 6   worldwide_gross    1179 non-null   float64
 7   year_x             1179 non-null   int64
 8   profit             1179 non-null   float64
 9   profit_margin      1179 non-null   float64
 10  movie_and_year     1179 non-null   object
 11  tconst             1179 non-null   object
 12  titleType          1179 non-null   object
 13  primaryTitle       1179 non-null   object
 14  originalTitle      1179 non-null   object
 15  isAdult            1179 non-null   int64
 16  startYear          1179 non-null   object
 17  endYear            1179 non-null   object
 18  runtimeMinutes     1179 non-null   object
 19  genres             1179 non-null   object
 20  year_y             1179 non-null   float64
dtypes: float64(6), int64(4), object(11)
memory usage: 193.6+ KB

In [57]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import datetime
import string
punct = '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{}~'

In [58]:
transtab = str.maketrans(dict.fromkeys(punct, ''))

df_movies_info['primary_title'] = '|'.join(df_movies_info['primary_title'].tolist()).translate(transtab).split('|')

In [59]:
df_movies_info.head(5)

,movie_id,primary_title,genres,averagerating,numvotes,person_id,category,primary_name
0,tt0315642,Wazir,"Action,Crime,Drama",7.1,15378,nm2349060,director,Bejoy Nambiar
1,tt0369610,Jurassic World,"Action,Adventure,Sci-Fi",7.0,539338,nm1119880,director,Colin Trevorrow
2,tt0398286,Tangled,"Adventure,Animation,Comedy",7.8,366366,nm1977355,director,Nathan Greno
3,tt0398286,Tangled,"Adventure,Animation,Comedy",7.8,366366,nm0397174,director,Byron Howard
4,tt0433035,Real Steel,"Action,Drama,Family",7.1,283534,nm0506613,director,Shawn Levy

In [60]:
df_financial_data = df_financial_data.dropna()

In [61]:
df_financial_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1179 entries, 0 to 1178
Data columns (total 21 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         1179 non-null   int64
 1   id                 1179 non-null   int64
 2   release_date       1179 non-null   object
 3   movie              1179 non-null   object
 4   production_budget  1179 non-null   float64
 5   domestic_gross     1179 non-null   float64
 6   worldwide_gross    1179 non-null   float64
 7   year_x             1179 non-null   int64
 8   profit             1179 non-null   float64
 9   profit_margin      1179 non-null   float64
 10  movie_and_year     1179 non-null   object
 11  tconst             1179 non-null   object
 12  titleType          1179 non-null   object
 13  primaryTitle       1179 non-null   object
 14  originalTitle      1179 non-null   object
 15  isAdult            1179 non-null   int64
 16  startYear          1179 non-null   object
 17  endYear            1179 non-null   object
 18  runtimeMinutes     1179 non-null   object
 19  genres             1179 non-null   object
 20  year_y             1179 non-null   float64
dtypes: float64(6), int64(4), object(11)
memory usage: 202.6+ KB

In [62]:
df_financial_data = df_financial_data.drop(['Unnamed: 0', 'id', 'startYear', 'endYear', 'year_y', 'originalTitle'], axis=1)

In [63]:
df_financial_data = df_financial_data.rename(columns={'tconst': 'movie_id', 'primaryTitle': 'primary_title'})

In [64]:
df_mf_combo = df_movies_info.merge(df_financial_data, on=['movie_id', 'primary_title', 'genres'], how='inner')

In [65]:
df_mf_combo.head()

,movie_id,primary_title,genres,averagerating,numvotes,person_id,category,primary_name,release_date,movie,production_budget,domestic_gross,worldwide_gross,year_x,profit,profit_margin,movie_and_year,titleType,isAdult,runtimeMinutes
0,tt0443272,Lincoln,"Biography,Drama,History",7.4,228701,nm0000229,director,Steven Spielberg,2012-11-09,Lincoln,65000000.0,182207973.0,273346281.0,2012,208346281.0,76.220639,Lincoln - 2012,movie,0,150
1,tt0448115,Shazam,"Action,Adventure,Comedy",7.4,109051,nm2497546,director,David F. Sandberg,2019-04-05,Shazam,85000000.0,139606856.0,362899733.0,2019,277899733.0,76.577552,Shazam - 2019,movie,0,132
2,tt0453562,42,"Biography,Drama,Sport",7.5,77703,nm0001338,director,Brian Helgeland,2013-04-12,42,31000000.0,95020213.0,97470701.0,2013,66470701.0,68.195571,42 - 2013,movie,0,128
3,tt0455944,The Equalizer,"Action,Crime,Thriller",7.2,302302,nm0298807,director,Antoine Fuqua,2014-09-26,The Equalizer,55000000.0,101530738.0,192903624.0,2014,137903624.0,71.488353,The Equalizer - 2014,movie,0,132
4,tt0790636,Dallas Buyers Club,"Biography,Drama",8.0,402462,nm0885249,director,Jean-Marc Vallée,2013-11-01,Dallas Buyers Club,5000000.0,27298285.0,60611845.0,2013,55611845.0,91.750787,Dallas Buyers Club - 2013,movie,0,117

In [66]:
df_mf_combo.value_counts(['genres'])

genres
Comedy,Drama               16
Comedy,Drama,Romance       15
Drama                      13
Drama,Romance              11
Biography,Drama,Sport      10
                           ..
Comedy,Drama,Family         1
Comedy,Crime,Thriller       1
Mystery,Thriller            1
Biography,Drama,Musical     1
Comedy                      1
Length: 80, dtype: int64

In [67]:
df_mf_combo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 230 entries, 0 to 229
Data columns (total 20 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie_id           230 non-null    object
 1   primary_title      230 non-null    object
 2   genres             230 non-null    object
 3   averagerating      230 non-null    float64
 4   numvotes           230 non-null    int64
 5   person_id          230 non-null    object
 6   category           230 non-null    object
 7   primary_name       230 non-null    object
 8   release_date       230 non-null    object
 9   movie              230 non-null    object
 10  production_budget  230 non-null    float64
 11  domestic_gross     230 non-null    float64
 12  worldwide_gross    230 non-null    float64
 13  year_x             230 non-null    int64
 14  profit             230 non-null    float64
 15  profit_margin      230 non-null    float64
 16  movie_and_year     230 non-null    object
 17  titleType          230 non-null    object
 18  isAdult            230 non-null    int64
 19  runtimeMinutes     230 non-null    object
dtypes: float64(6), int64(3), object(11)
memory usage: 37.7+ KB

In [75]:
df_mf_combo = df_mf_combo.sort_values(by=['profit_margin', 'averagerating'], ascending=False)

In [76]:
df_mf_combo.head(15)

,movie_id,primary_title,genres,averagerating,numvotes,person_id,category,primary_name,release_date,movie,production_budget,domestic_gross,worldwide_gross,year_x,profit,profit_margin,movie_and_year,titleType,isAdult,runtimeMinutes
205,tt5052448,Get Out,"Horror,Mystery,Thriller",7.7,400474,nm1443502,director,Jordan Peele,2017-02-24,Get Out,5000000.0,176040665.0,255367951.0,2017,250367951.0,98.042041,Get Out - 2017,movie,0,104
204,tt4975722,Moonlight,Drama,7.4,227964,nm1503575,director,Barry Jenkins,2016-10-21,Moonlight,1500000.0,27854931.0,65245512.0,2016,63745512.0,97.700991,Moonlight - 2016,movie,0,111
207,tt5074352,Dangal,"Action,Biography,Drama",8.5,123638,nm4318159,director,Nitesh Tiwari,2016-12-21,Dangal,9500000.0,12391761.0,294654618.0,2016,285154618.0,96.775886,Dangal - 2016,movie,0,161
159,tt2582846,The Fault in Our Stars,"Drama,Romance",7.7,315135,nm1837748,director,Josh Boone,2014-06-06,The Fault in Our Stars,12000000.0,124872350.0,307166834.0,2014,295166834.0,96.093328,The Fault in Our Stars - 2014,movie,0,126
12,tt0947798,Black Swan,"Drama,Thriller",8.0,648854,nm0004716,director,Darren Aronofsky,2010-12-03,Black Swan,13000000.0,106954678.0,331266710.0,2010,318266710.0,96.075670,Black Swan - 2010,movie,0,108
22,tt1179933,10 Cloverfield Lane,"Drama,Horror,Mystery",7.2,260383,nm0870469,director,Dan Trachtenberg,2016-03-11,10 Cloverfield Lane,5000000.0,72082999.0,108286422.0,2016,103286422.0,95.382616,10 Cloverfield Lane - 2016,movie,0,103
184,tt3783958,La La Land,"Comedy,Drama,Music",8.0,436070,nm3227090,director,Damien Chazelle,2016-12-09,La La Land,20000000.0,151101803.0,426351163.0,2016,406351163.0,95.309031,La La Land - 2016,movie,0,128
20,tt1120985,Blue Valentine,"Drama,Romance",7.4,170089,nm0161834,director,Derek Cianfrance,2010-12-29,Blue Valentine,1000000.0,9737892.0,16566240.0,2010,15566240.0,93.963627,Blue Valentine - 2010,movie,0,112
100,tt1727824,Bohemian Rhapsody,"Biography,Drama,Music",8.0,345466,nm0001741,director,Bryan Singer,2018-11-02,Bohemian Rhapsody,55000000.0,216303339.0,894985342.0,2018,839985342.0,93.854648,Bohemian Rhapsody - 2018,movie,0,134
63,tt1457767,The Conjuring,"Horror,Mystery,Thriller",7.5,397233,nm1490123,director,James Wan,2013-07-19,The Conjuring,20000000.0,137400141.0,318000141.0,2013,298000141.0,93.710695,The Conjuring - 2013,movie,0,112
154,tt2543472,Wonder,"Drama,Family",8.0,111632,nm0154716,director,Stephen Chbosky,2017-11-17,Wonder,20000000.0,132422809.0,304604712.0,2017,284604712.0,93.434113,Wonder - 2017,movie,0,113
125,tt2084970,The Imitation Game,"Biography,Drama,Thriller",8.0,620834,nm0878763,director,Morten Tyldum,2014-11-28,The Imitation Game,15000000.0,91125143.0,227740463.0,2014,212740463.0,93.413555,The Imitation Game - 2014,movie,0,114
16,tt1065073,Boyhood,Drama,7.9,315584,nm0000500,director,Richard Linklater,2014-07-11,Boyhood,4000000.0,25379975.0,57273049.0,2014,53273049.0,93.015912,Boyhood - 2014,movie,0,165
225,tt6966692,Green Book,"Biography,Comedy,Drama",8.3,204972,nm0268380,director,Peter Farrelly,2018-11-16,Green Book,23000000.0,85080171.0,322034439.0,2018,299034439.0,92.857907,Green Book - 2018,movie,0,130
58,tt1431045,Deadpool,"Action,Adventure,Comedy",8.0,820847,nm1783265,director,Tim Miller,2016-02-12,Deadpool,58000000.0,363070709.0,801025593.0,2016,743025593.0,92.759283,Deadpool - 2016,movie,0,108

In [94]:
#df_mf_combo['genres'].value_counts(normalize=False)
df_mf_combo.sort_values(by=['genres'])

,movie_id,primary_title,genres,averagerating,numvotes,person_id,category,primary_name,release_date,movie,production_budget,domestic_gross,worldwide_gross,year_x,profit,profit_margin,movie_and_year,titleType,isAdult,runtimeMinutes
192,tt4302938,Kubo and the Two Strings,"Action,Adventure,Animation",7.8,105578,nm1325899,director,Travis Knight,2016-08-19,Kubo and the Two Strings,55000000.0,48023088.0,77548122.0,2016,22548122.0,29.076297,Kubo and the Two Strings - 2016,movie,0,101
68,tt1490017,The Lego Movie,"Action,Adventure,Animation",7.8,304179,nm0588087,director,Christopher Miller,2014-02-07,The Lego Movie,60000000.0,257784718.0,457729388.0,2014,397729388.0,86.891818,The Lego Movie - 2014,movie,0,100
67,tt1490017,The Lego Movie,"Action,Adventure,Animation",7.8,304179,nm0520488,director,Phil Lord,2014-02-07,The Lego Movie,60000000.0,257784718.0,457729388.0,2014,397729388.0,86.891818,The Lego Movie - 2014,movie,0,100
163,tt2719848,Everest,"Action,Adventure,Biography",7.1,181133,nm0466349,director,Baltasar Kormákur,2015-09-18,Everest,65000000.0,43482270.0,221297061.0,2015,156297061.0,70.627717,Everest - 2015,movie,0,121
58,tt1431045,Deadpool,"Action,Adventure,Comedy",8.0,820847,nm1783265,director,Tim Miller,2016-02-12,Deadpool,58000000.0,363070709.0,801025593.0,2016,743025593.0,92.759283,Deadpool - 2016,movie,0,108
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
63,tt1457767,The Conjuring,"Horror,Mystery,Thriller",7.5,397233,nm1490123,director,James Wan,2013-07-19,The Conjuring,20000000.0,137400141.0,318000141.0,2013,298000141.0,93.710695,The Conjuring - 2013,movie,0,112
205,tt5052448,Get Out,"Horror,Mystery,Thriller",7.7,400474,nm1443502,director,Jordan Peele,2017-02-24,Get Out,5000000.0,176040665.0,255367951.0,2017,250367951.0,98.042041,Get Out - 2017,movie,0,104
132,tt2172935,Metallica Through the Never,Music,7.2,15592,nm0030735,director,Nimród Antal,2013-09-27,Metallica Through the Never,18000000.0,3419967.0,9082906.0,2013,-8917094.0,-98.174461,Metallica Through the Never - 2013,movie,0,93
21,tt1130884,Shutter Island,"Mystery,Thriller",8.1,1005960,nm0000217,director,Martin Scorsese,2010-02-19,Shutter Island,80000000.0,128012934.0,299461782.0,2010,219461782.0,73.285406,Shutter Island - 2010,movie,0,138
48,tt1385826,The Adjustment Bureau,"Romance,Sci-Fi,Thriller",7.1,227616,nm1079776,director,George Nolfi,2011-03-04,The Adjustment Bureau,50200000.0,62495645.0,126931325.0,2011,76731325.0,60.451055,The Adjustment Bureau - 2011,movie,0,106

In [96]:
df_combo2 = df_mf_combo.head(50)

In [100]:
df_combo2['genres'].value_counts()

Comedy,Drama,Romance          4
Drama,Romance                 4
Drama                         4
Biography,Comedy,Drama        3
Horror,Mystery,Thriller       3
Animation,Comedy,Family       2
Biography,Drama,History       2
Action,Biography,Drama        2
Action,Adventure,Comedy       2
Adventure,Animation,Comedy    2
Biography,Drama,Family        2
Biography,Drama               2
Comedy,Documentary            2
Biography,Drama,Thriller      1
Drama,Horror,Mystery          1
Drama,Mystery                 1
Action,Adventure,Sci-Fi       1
Drama,Thriller                1
Comedy,Drama                  1
Action,Comedy,Documentary     1
Biography,Drama,Romance       1
Adventure,Comedy,Drama        1
Comedy,Drama,Music            1
Drama,Family                  1
Biography,Drama,Music         1
Action,Drama                  1
Adventure,Drama,Fantasy       1
Drama,Music                   1
Drama,Mystery,Thriller        1
Name: genres, dtype: int64

Conclusion:
- Would ya look at that, this might be the ID we need to link an ID to a title, which could link us to the rest of the data
- We should probably look and see what the difference is between the domestic_gross represented here versus domestic_gross in "bom.movie_gross.csv.gz"
- This data set likely is going to be very valuable in linking together the different csv files